Ran Plan for dir: `poc/dev/fulfillment` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_secret_manager_secret.basic_auth_pass will be created
  + resource "google_secret_manager_secret" "basic_auth_pass" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "******************"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret.client_api_key will be created
  + resource "google_secret_manager_secret" "client_api_key" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "*****************"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret.flask_session_key will be created
  + resource "google_secret_manager_secret" "flask_session_key" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "********************"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_version.basic_auth_pass_v1 will be created
  + resource "google_secret_manager_secret_version" "basic_auth_pass_v1" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.client_api_key_v1 will be created
  + resource "google_secret_manager_secret_version" "client_api_key_v1" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.flask_session_key_v1 will be created
  + resource "google_secret_manager_secret_version" "flask_session_key_v1" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # random_password.FC_BASIC_AUTH_PASS will be created
  + resource "random_password" "FC_BASIC_AUTH_PASS" {
      + id          = (known after apply)
      + keepers     = {
          + "version" = "1"
        }
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.FC_CLIENT_API_KEY will be created
  + resource "random_password" "FC_CLIENT_API_KEY" {
      + id          = (known after apply)
      + keepers     = {
          + "version" = "1"
        }
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.FC_FLASK_SESSION_KEY will be created
  + resource "random_password" "FC_FLASK_SESSION_KEY" {
      + id          = (known after apply)
      + keepers     = {
          + "version" = "1"
        }
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d poc/dev/fulfillment`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.193.191.10:4141/lock?id=tandonc%252Fterraform-google-ccai%252Fpoc%252Fdev%252Ffulfillment%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d poc/dev/fulfillment`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
